artillery-tmp.yaml
config:
  target: "https://<INSERT VALUE FROM API GATEWAY HERE>.execute-api.<YOUR REGION>.amazonaws.com"
  phases:
  - duration: 600
    arrivalRate: 1
scenarios:
- flow:
  - get:
      url: "/Prod/showMyIp"
      capture:
        json: "$.function-version"
        as: "id"
  - log: "Function version: {{ id }}"